tutorials/rheoHeatFoam/channel/PTTLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             PTTLog;

                rho              rho [1 -3 0 0 0 0 0] 4473.925816;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.;
                etaP             etaP [1 -1 -1 0 0 0 0] 200.020012;             
                lambda           lambda [0 0 1 0 0 0 0] 0.008946956;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.625;
                zeta             zeta [0 0 0 0 0 0 0] 0; 
              
                thermoEta
                {
                  type          Arrhenius;
                  alpha         alpha [0 0 0 1 0 0 0] 1720;
                  T0            T0 [ 0 0 0 1 0 0 0] 463.15;
                }
                
                thermoLambda
                {
                  type          Arrhenius;
                  alpha         alpha [0 0 0 1 0 0 0] 1720;
                  T0            T0 [ 0 0 0 1 0 0 0] 463.15;
                }
                 
                destructionFunctionType  linear;
               
                stabilization    coupling;                  
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
